src/test/testtool/ZoekMetGeslachtsnaamEnGeboortedatum/03/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310"
         xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml"
         xmlns:str="http://exslt.org/strings" xmlns:w="http://schemas.xmlsoap.org/wsdl/"
         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <BG:stuurgegevens>
            <StUF:berichtcode>La01</StUF:berichtcode>
            <StUF:zender>
               <StUF:organisatie>test</StUF:organisatie>
               <StUF:applicatie>test123</StUF:applicatie>
               <StUF:administratie>TEST</StUF:administratie>
               <StUF:gebruiker>TEST</StUF:gebruiker>
            </StUF:zender>
            <StUF:ontvanger>
               <StUF:organisatie />
               <StUF:applicatie>TOP</StUF:applicatie>
               <StUF:administratie />
               <StUF:gebruiker>TEST</StUF:gebruiker>
            </StUF:ontvanger>
            <StUF:tijdstipBericht>20241015062939134</StUF:tijdstipBericht>
            <StUF:crossRefnummer>6bdd32e3-91bb-44ac-befb-cccc3ec661fe</StUF:crossRefnummer>
            <StUF:entiteittype>NPS</StUF:entiteittype>
         </BG:stuurgegevens>
         <BG:parameters>
            <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
            <StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
            <StUF:aantalVoorkomens>3</StUF:aantalVoorkomens>
         </BG:parameters>
         <BG:antwoord>
            <BG:object StUF:entiteittype="NPS">
               <BG:inp.bsn>999994335</BG:inp.bsn>
               <BG:sub.typering xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsnaam>Holthuizen</BG:geslachtsnaam>
               <BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:voorletters>P.F.</BG:voorletters>
               <BG:voornamen>Pepijn Floris</BG:voornamen>
               <BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
               <BG:geboortedatum>19800526</BG:geboortedatum>
               <BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.verblijftIn StUF:entiteittype="NPSTGO" xsi:nil="true"
                  StUF:noValue="nietGeautoriseerd" />
               <BG:sub.verblijfBuitenland>
                  <BG:lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend" />
                  <BG:lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
               </BG:sub.verblijfBuitenland>
               <BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
               <BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:ing.indicatieBlokkering xsi:nil="true" StUF:noValue="waardeOnbekend" />
            </BG:object>
            <BG:object StUF:entiteittype="NPS">
               <BG:inp.bsn>999994736</BG:inp.bsn>
               <BG:sub.typering xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsnaam>Burck</BG:geslachtsnaam>
               <BG:voorvoegselGeslachtsnaam>du</BG:voorvoegselGeslachtsnaam>
               <BG:voorletters>K.M.</BG:voorletters>
               <BG:voornamen>Karin Monique</BG:voornamen>
               <BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
               <BG:geboortedatum>19511223</BG:geboortedatum>
               <BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.verblijftIn StUF:entiteittype="NPSTGO" xsi:nil="true"
                  StUF:noValue="nietGeautoriseerd" />
               <BG:sub.verblijfBuitenland>
                  <BG:lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend" />
                  <BG:lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
               </BG:sub.verblijfBuitenland>
               <BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
               <BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:ing.indicatieBlokkering xsi:nil="true" StUF:noValue="waardeOnbekend" />
            </BG:object>
            <BG:object StUF:entiteittype="NPS">
               <BG:inp.bsn>999994293</BG:inp.bsn>
               <BG:sub.typering xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.a-nummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsnaam>Holthuizen</BG:geslachtsnaam>
               <BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:voorletters>D.</BG:voorletters>
               <BG:voornamen>Dirk</BG:voornamen>
               <BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:geslachtsaanduiding>M</BG:geslachtsaanduiding>
               <BG:geboortedatum>19460121</BG:geboortedatum>
               <BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.verblijftIn StUF:entiteittype="NPSTGO" xsi:nil="true"
                  StUF:noValue="nietGeautoriseerd" />
               <BG:sub.verblijfBuitenland>
                  <BG:lnd.landcode xsi:nil="true" StUF:noValue="waardeOnbekend" />
                  <BG:lnd.landnaam xsi:nil="true" StUF:noValue="waardeOnbekend" />
               </BG:sub.verblijfBuitenland>
               <BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:sub.emailadres xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:sub.url xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.burgerlijkeStaat>1</BG:inp.burgerlijkeStaat>
               <BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.immigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:inp.emigratieLand xsi:nil="true" StUF:noValue="nietGeautoriseerd" />
               <BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" />
               <BG:ing.indicatieBlokkering xsi:nil="true" StUF:noValue="waardeOnbekend" />
            </BG:object>
         </BG:antwoord>
      </BG:npsLa01>
   </soapenv:Body>
</soapenv:Envelope>